alefragnani.project-manager
alibaba-cloud.tongyi-lingma
christian-kohler.path-intellisense
formulahendry.code-runner
github.vscode-github-actions
golang.go
google.geminicodeassist
iterative.dvc
jeanp413.open-remote-ssh
mikestead.dotenv
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
pkief.material-icon-theme
redhat.vscode-yaml
tamasfe.even-better-toml
timonwong.shellcheck
usernamehw.errorlens
